Repository: shirleytruffierblanc/app2-firebase-deploy
Catalog: src/locale/messages.*.xlf
Languages: fr

# toolbar-title
source: My Application
fr: Mon Appplication

# tutorial-button
source: Tutorials
fr: Tutoriels

# template-button
source: Templates
fr: Model

# homeTitle
source: Tutorials
fr: Tutoriels

# FirstParagraphTutorials
source: <b><a>Firebase Authentication with Angular</a></b>: When developing web applications, any type of authentication feature is necessary. If you think of the many social platforms and email sign in options available, authentication looks like a very complex task. In this Angular 5 tutorial we will explore how to setup an email/password as well as social login authentication workflows for Angular 5 apps using AngularFire2 library.
fr: <b><a>Authentification avec Angular</a></b>: Lors du développement d'applications Web, tout type de fonction d'authentification est nécessaire. Si vous pensez aux nombreuses activités sociales et les options d'ouverture de session par courriel disponibles, l'authentification ressemble à une authentification tâche très complexe. Dans ce tutoriel d'Angular 5, nous allons explorer comment configurer un email/mot de passe ainsi que des workflows d'authentification de connexion sociale pour Angular 5 applications utilisant la bibliothèque AngularFire2.

# SecondParagraphTutorials
source: <b><a>Learn Angular from scratch step by step</a></b>: Angular step by step tutorial covering from basic concepts of Angular Framework to building a complete Angular 5 app using Angular Material components. We will go through the main building blocks of an Angular application as well as the best practices for building a complete app with Angular. Also, this tutorial shows how to setup your development environment and workflow so you can start developing Angular apps right away.
fr: <b><a>Apprendre Agular en partant de zéro, étape par étape</a></b>: Tutoriel pas à pas angulaire des concepts de base du cadre angulaire jusqu'à la construction d'un cadre de travail complet, en passant par l'élaboration d'un Angular 5 app en utilisant les composants Angular Material. Nous allons passer en revue les principaux d'une application angulaire ainsi que les meilleures pratiques en matière de construire une application complète avec Angular. Aussi, ce tutoriel montre comment configurer votre environnement de développement et votre flux de travail pour que vous puissiez commencer à développer Angular tout de suite.

# ThirdParagraphTutorials
source: <b><a> Angular 5 Forms and Validations</a></b>: We created this angular forms tutorial to help you learn everything about Angular forms validations in angular 5 apps. These angular forms examples are updated using the best (coding) practices to build Angular 5 apps with Material Design.
fr: <b><a> Angular 5 Formulaires et validations</a></b>: Nous avons créé ces formes angulaires pour vous aider à tout apprendre sur les validations de formulaires angulaires dans angular 5 apps. Ces exemples de formes angulaires sont mis à jour à l'aide des meilleurs exemples de formes angulaires. (codage) pour construire des applications Angular 5 avec Material Design.

# FourthParagraphTutorials
source: <b><a> Learn how to build a MEAN stack application in this Angular tutorial</a> </b>: The goal of this Angular tutorial is to guide you through the coding of a full-stack JavaScript example application project and connecting a backend API to an Angular 5 front-end application employing the MEAN stack. By the end of this Angular advanced tutorial, you will learn about the MEAN stack from scratch, including how to build a RESTful API with Loopback and using it to perform CRUD operations on a MongoDB database through an Angular frontend.
fr: <b><a> Apprenez comment construire une application de pile MOYENNE dans ce tutoriel Angular</a> </b>: Le but de ce tutoriel Angulaire est de vous guider à travers le codage d'un fichier exemple de projet d'application JavaScript en pile complète et connexion d'un backend API à une application frontale Angular 5 utilisant la pile MEAN. Par le fin de ce tutoriel avancé Angular, vous découvrirez la pile MEAN à partir de zéro, y compris la création d'une API RESTful avec Loopback et l'utilisation de d'effectuer des opérations CRUD sur une base de données MongoDB par le biais d'une base de données Angular frontend.

# templatesTitle
source: Templates
fr: Model

# FirstParagraphTemplates
source: <b><a> Angular 6 Site Template</a></b>: Reuse the beautiful, responsive and flexible custom components we built for this Angular 6 Template. With Bootstrap 4, Angular Universal (Server Side Rendering), SEO, Lazy Loading and a detailed documentation on how to get started building Angular apps. Tons of use cases implemented the Angular way such as authentication flows, product listing, filtering, forms, routing guards and more.
fr: <b><a> Angular 6 Modèle de site</a></b>: Réutiliser le beau, réactif et flexible les composants personnalisés que nous avons construits pour ce modèle Angular 6. Avec Bootstrap 4, Angular Universal (Server Side Rendering), SEO, Lazy Loading et un détail détaillé documentation sur la façon de commencer à créer des applications Angular. Tonnes de cas d'utilisation implémentation de la méthode Angulaire telle que les flux d'authentification, les listes de produits, filtrage, formulaires, gardes de routage et plus encore.

# SecondParagraphTemplates
source: <b><a> Angular Admin Template</a></b>: Created with performance and ease of development in mind, this Angular 5 web template is something you will love. It includes all the components that you might need inside a project and a detailed documentation on how to get started.
fr: <b><a> Gabarit d'administration Angular</a></b>: Créé avec performance et facilité d'utilisation à l'esprit, ce gabarit Angular 5 est quelque chose que vous allez adorer. Il inclut tous les composants dont vous pourriez avoir besoin à l'intérieur d'un projet et d'un fichier une documentation détaillée sur la façon de commencer.

# notFoundTitle
source: Not found 404
fr: Pas trouvé 404

# bonjour
source: hello
fr: Bonjour

# message
source: you have {minutes, plural, =0 {0 messages} =1 {1 message} other {{{minutes}} messages}}
fr: vous avez {minutes, plural, =0 {0 message} =1 {1 message} other {{{minutes}} messages}}
